Revit 2024 API
ViewSystemsAnalysisReport.CancelSystemsAnalysis Method
 Cancels the systems analysis based on the report element id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static void CancelSystemsAnalysis(
	Document document,
	ElementId reportElement
)
Visual Basic
Public Shared Sub CancelSystemsAnalysis ( _
	document As Document, _
	reportElement As ElementId _
)
Visual C++
public:
static void CancelSystemsAnalysis(
	Document^ document,
	ElementId^ reportElement
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document where the report element existed.
reportElement
Type: Autodesk.Revit.DB.ElementId
 The report element that identifies the analysis.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace